## ch08.R
##
## 浅野正彦・矢内勇生. 2018. 『Rによる計量政治学』オーム社
## 第8章 統計的検定
##
## Created: 2018-11-22 Yuki Yanai
## Modified: 2018-11-24 YY

## tidyverse パッケージを読み込む
library("tidyverse")
if (capabilities("aqua")) { # Macかどうか判定し、Macの場合のみ実行
  theme_set(theme_gray(base_size = 10, base_family = "HiraginoSans-W3"))
}     

####################################################
## 8.1  統計的仮説検定の基礎
####################################################

## 標本サイズnのとき、
## 有意水準alphaで両側検定を行うときの臨界値を求める
n <- 100        # n = 100 の場合を考える
alpha <-  0.05  # alpha = 0.05 の場合を考える
qt(p = alpha / 2, df = n - 1, lower.tail = FALSE)  ## 上側臨界値
qt(p = alpha / 2, df = n - 1, lower.tail = TRUE)   ## 下側臨界値


####################################################
## 8.2  統計的仮説検定の諸問題
####################################################

## Rコードなし
